duxinglang-1/nRF9160_test/AURI_TEST/src/imu/lsm6dso.c
	return true;
}

void sensor_reset(void)
{  
	lsm6dso_reset_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_reset_get(&imu_dev_ctx, &rst);

	lsm6dso_i3c_disable_set(&imu_dev_ctx, LSM6DSO_I3C_DISABLE);

	//max supported frames at 3KB FIFO, 512*6 = 3072. Each frame has 6 axis and each axis is 2 byte in size.
	lsm6dso_fifo_watermark_set(&imu_dev_ctx, ACC_GYRO_FIFO_BUF_LEN);
	lsm6dso_fifo_stop_on_wtm_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_STREAM_MODE);

	lsm6dso_data_ready_mode_set(&imu_dev_ctx, LSM6DSO_DRDY_PULSED);

	/*
	lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	int1_route.int1_ctrl.int1_fifo_th = PROPERTY_ENABLE;
	lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);
	*/

	lsm6dso_fifo_xl_batch_set(&imu_dev_ctx, LSM6DSO_XL_BATCHED_AT_104Hz);
	lsm6dso_fifo_gy_batch_set(&imu_dev_ctx, LSM6DSO_GY_BATCHED_AT_104Hz);

	lsm6dso_xl_full_scale_set(&imu_dev_ctx, LSM6DSO_2g);
	lsm6dso_gy_full_scale_set(&imu_dev_ctx, LSM6DSO_250dps);
	lsm6dso_block_data_update_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_104Hz);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_104Hz);
}

/*@brief Get real time X/Y/Z reading in mg
*
*/
void get_sensor_reading(float *sensor_x, float *sensor_y, float *sensor_z)
{
	u8_t reg;

	lsm6dso_xl_flag_data_ready_get(&imu_dev_ctx, &reg);
	if(reg)
	{
		memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
		lsm6dso_acceleration_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
		acceleration_mg[0] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[0]);
		acceleration_mg[1] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[1]);
		acceleration_mg[2] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[2]);
	}

	*sensor_x = acceleration_mg[0];
	*sensor_y = acceleration_mg[1];
	*sensor_z = acceleration_mg[2];
}

void historic_buffer(void)
{
	uint16_t histBuff_counter = 0;
	uint16_t i = 0;

	while(1)
	{
		uint16_t num = 0;
		uint8_t waterm = 0;
		lsm6dso_fifo_tag_t reg_tag;
		axis3bit16_t dummy;

		lsm6dso_fifo_wtm_flag_get(&imu_dev_ctx, &waterm);
		if(waterm>0)
		{
			lsm6dso_fifo_data_level_get(&imu_dev_ctx, &num);

			while(num--)
			{
				lsm6dso_fifo_sensor_tag_get(&imu_dev_ctx, &reg_tag);
				switch (reg_tag)
				{
				case LSM6DSO_XL_NC_TAG:
					memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
					lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
					acceleration_mg[0] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[0]);
					acceleration_mg[1] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[1]);
					acceleration_mg[2] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[2]);

					acceleration_g[0]   = acceleration_mg[0]/1000;
					acceleration_g[1]   = acceleration_mg[1]/1000;
					acceleration_g[2]   = acceleration_mg[2]/1000;

					acc_x_hist_buffer[i] = acceleration_g[0]; //[i]
					acc_y_hist_buffer[i] = acceleration_g[1];
					acc_z_hist_buffer[i] = acceleration_g[2];   

					histBuff_counter++;
					//LOGD("%d, Axyz, %4.2f, %4.2f, %4.2f",
					//			i, acc_x_hist_buffer[i], acc_y_hist_buffer[i], acc_z_hist_buffer[i]);
					break;

				case LSM6DSO_GYRO_NC_TAG:
					memset(data_raw_angular_rate.u8bit, 0x00, 3*sizeof(int16_t));
					lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_angular_rate.u8bit);
					angular_rate_mdps[0] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[0]);
					angular_rate_mdps[1] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[1]);
					angular_rate_mdps[2] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[2]);

					angular_rate_dps[0] = angular_rate_mdps[0]/1000;
					angular_rate_dps[1] = angular_rate_mdps[1]/1000;
					angular_rate_dps[2] = angular_rate_mdps[2]/1000;

					gyro_x_hist_buffer[i] = angular_rate_dps[0];
					gyro_y_hist_buffer[i] = angular_rate_dps[1];
					gyro_z_hist_buffer[i] = angular_rate_dps[2];

					histBuff_counter++;
					i++;
					//LOGD("%d, Gxyz, %4.2f, %4.2f, %4.2f",
					//				i, angular_rate_dps[0], angular_rate_dps[1], angular_rate_dps[2]);
					break;

				default:
					memset(dummy.u8bit, 0x00, 3 * sizeof(int16_t));
					lsm6dso_fifo_out_raw_get(&imu_dev_ctx, dummy.u8bit);
					break;
				}         
			}

			//lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_BYPASS_MODE); //clear FIFO contents
			//lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_BYPASS_TO_FIFO_MODE); //switch to bypass_to_fifo mode

			if(histBuff_counter == PATTERN_LEN)
			{
				//LOGD("HIST BUFFER FLAG ON");
				hist_buff_flag = true;
				break;
			}
		}
		else
		{
			break;
		}
	}
}

void curr_vrif_buffers(void)
{
	uint16_t buff_counter = 0;

	sensor_reset();
	
	while(1)
	{
		uint16_t num = 0;
		uint8_t waterm = 0;
		uint8_t i_rev = ACC_GYRO_FIFO_BUF_LEN-1;
		uint8_t j_rev = ACC_GYRO_FIFO_BUF_LEN-1;
		uint8_t k_rev = ACC_GYRO_FIFO_BUF_LEN-1;
		uint8_t l_rev = ACC_GYRO_FIFO_BUF_LEN-1;
		uint8_t m_rev = ACC_GYRO_FIFO_BUF_LEN-1;

		lsm6dso_fifo_wtm_flag_get(&imu_dev_ctx, &waterm);
		if(waterm>0)
		{
			lsm6dso_fifo_data_level_get(&imu_dev_ctx, &num);
			while(num--)
			{
				memset(data_raw_angular_rate.u8bit, 0x00, 3*sizeof(int16_t));
				lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_angular_rate.u8bit);
				angular_rate_mdps[0] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[0]);
				angular_rate_mdps[1] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[1]);
				angular_rate_mdps[2] = lsm6dso_from_fs250_to_mdps(data_raw_angular_rate.i16bit[2]);

				angular_rate_dps[0]  = angular_rate_mdps[0]/1000;
				angular_rate_dps[1]  = angular_rate_mdps[1]/1000;
				angular_rate_dps[2]  = angular_rate_mdps[2]/1000;
				gyro_tempX[num]      = angular_rate_dps[0];
				gyro_tempY[num]      = angular_rate_dps[1];
				gyro_tempZ[num]      = angular_rate_dps[2];

				memset(data_raw_acceleration.u8bit, 0x00, 3*sizeof(int16_t));
				lsm6dso_fifo_out_raw_get(&imu_dev_ctx, data_raw_acceleration.u8bit);
				acceleration_mg[0] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[0]);
				acceleration_mg[1] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[1]);
				acceleration_mg[2] = lsm6dso_from_fs2_to_mg(data_raw_acceleration.i16bit[2]);

				acceleration_g[0]  = acceleration_mg[0]/1000;
				acceleration_g[1]  = acceleration_mg[1]/1000;
				acceleration_g[2]  = acceleration_mg[2]/1000;
				accel_tempX[num]   = acceleration_g[0];
				accel_tempY[num]   = acceleration_g[1];
				accel_tempZ[num]   = acceleration_g[2];
				buff_counter++;

				if(buff_counter >= ACC_GYRO_FIFO_BUF_LEN && buff_counter < 2*ACC_GYRO_FIFO_BUF_LEN)
				{
					for (uint8_t i = 0; i < ACC_GYRO_FIFO_BUF_LEN; i++)
					{
						acc_x_cur_buffer[i]  = accel_tempX[i_rev];
						acc_y_cur_buffer[i]  = accel_tempY[i_rev];
						acc_z_cur_buffer[i]  = accel_tempZ[i_rev];
						gyro_x_cur_buffer[i] = gyro_tempX[i_rev];
						gyro_y_cur_buffer[i] = gyro_tempY[i_rev];
						gyro_z_cur_buffer[i] = gyro_tempZ[i_rev];
						buff_counter++;
						i_rev--;

						//LOGD("%d, Cur_Axyz, %4.2f, %4.2f, %4.2f",
						//			i, acc_x_cur_buffer[i], acc_y_cur_buffer[i], acc_z_cur_buffer[i]);
					}
				}

				if(buff_counter >= 3*ACC_GYRO_FIFO_BUF_LEN && buff_counter < 4*ACC_GYRO_FIFO_BUF_LEN)
				{
					for (uint8_t j = 0; j < ACC_GYRO_FIFO_BUF_LEN; j++)
					{
						acc_x_vrif_buffer[j]  = accel_tempX[j_rev];
						acc_y_vrif_buffer[j]  = accel_tempY[j_rev];
						acc_z_vrif_buffer[j]  = accel_tempZ[j_rev];
						gyro_x_vrif_buffer[j] = gyro_tempX[j_rev];
						gyro_y_vrif_buffer[j] = gyro_tempY[j_rev];
						gyro_z_vrif_buffer[j] = gyro_tempZ[j_rev];
						buff_counter++;
						j_rev--;

						//LOGD("%d, Veri_Axyz, %4.2f, %4.2f, %4.2f",
						//			j, acc_x_vrif_buffer[j], acc_y_vrif_buffer[j], acc_z_vrif_buffer[j]);
					}
				}

				if(buff_counter >= 5*ACC_GYRO_FIFO_BUF_LEN && buff_counter < 6*ACC_GYRO_FIFO_BUF_LEN)
				{
					for (uint8_t k = 0; k < ACC_GYRO_FIFO_BUF_LEN; k++)
					{
						acc_x_vrif_buffer_1[k]  = accel_tempX[k_rev];
						acc_y_vrif_buffer_1[k]  = accel_tempY[k_rev];
						acc_z_vrif_buffer_1[k]  = accel_tempZ[k_rev];
						gyro_x_vrif_buffer_1[k] = gyro_tempX[k_rev];
						gyro_y_vrif_buffer_1[k] = gyro_tempY[k_rev];
						gyro_z_vrif_buffer_1[k] = gyro_tempZ[k_rev];
						buff_counter++;
						k_rev--;

