duxinglang-1/nRF9160_test/AURI_TEST/src/imu/lsm6dso.c
						//LOGD("%d, Veri_Axyz_1, %4.2f, %4.2f, %4.2f",
						//			k, acc_x_vrif_buffer_1[k], acc_y_vrif_buffer_1[k], acc_z_vrif_buffer_1[k]);
					}
				}

                if(buff_counter >= 7*ACC_GYRO_FIFO_BUF_LEN && buff_counter < 8*ACC_GYRO_FIFO_BUF_LEN)
                {
                    for (uint8_t l = 0; l < ACC_GYRO_FIFO_BUF_LEN; l++)
                    {
                        acc_x_vrif_buffer_2[l]  = accel_tempX[l_rev];
                        acc_y_vrif_buffer_2[l]  = accel_tempY[l_rev];
                        acc_z_vrif_buffer_2[l]  = accel_tempZ[l_rev];
                        gyro_x_vrif_buffer_2[l] = gyro_tempX[l_rev];
                        gyro_y_vrif_buffer_2[l] = gyro_tempY[l_rev];
                        gyro_z_vrif_buffer_2[l] = gyro_tempZ[l_rev];
                        buff_counter++;
                        l_rev--;

                        //LOGD("%d, Veri_Axyz_1, %4.2f, %4.2f, %4.2f",
                        //          l, acc_x_vrif_buffer_1[l], acc_y_vrif_buffer_1[l], acc_z_vrif_buffer_1[l]);
                    }
                }

                if(buff_counter >= 9*ACC_GYRO_FIFO_BUF_LEN && buff_counter < 10*ACC_GYRO_FIFO_BUF_LEN)
                {
                    for (uint8_t m = 0; m < ACC_GYRO_FIFO_BUF_LEN; m++)
                    {
                        acc_x_vrif_buffer_3[m]  = accel_tempX[m_rev];
                        acc_y_vrif_buffer_3[m]  = accel_tempY[m_rev];
                        acc_z_vrif_buffer_3[m]  = accel_tempZ[m_rev];
                        gyro_x_vrif_buffer_3[m] = gyro_tempX[m_rev];
                        gyro_y_vrif_buffer_3[m] = gyro_tempY[m_rev];
                        gyro_z_vrif_buffer_3[m] = gyro_tempZ[m_rev];
                        buff_counter++;
                        m_rev--;

                        //LOGD("%d, Veri_Axyz_1, %4.2f, %4.2f, %4.2f",
                        //          m, acc_x_vrif_buffer_1[m], acc_y_vrif_buffer_1[m], acc_z_vrif_buffer_1[m]);
                    }
                }
			}

			if(buff_counter == 10*ACC_GYRO_FIFO_BUF_LEN)
			{
				curr_vrif_buff_flag = true;
				return;
			}
		}
	}
}

static float angle_analyse_fifo(void)
{
	volatile float angle_degree=0,avg_index=50;
	volatile float start_avg_accel_x=0,start_avg_accel_y=0,start_avg_accel_z=0;
	volatile float end_avg_accel_x=0, end_avg_accel_y=0, end_avg_accel_z=0;
	volatile float num=0,denom=0;
	volatile double angle=0;
	volatile uint16_t i;

	for(i = 0; i < avg_index; i++ )
	{       
		start_avg_accel_x += acc_x_hist_buffer[i];
		start_avg_accel_y += acc_y_hist_buffer[i];
		start_avg_accel_z += acc_z_hist_buffer[i];
	}
        
	start_avg_accel_x /=avg_index;										//get average for each axis
	start_avg_accel_y /=avg_index;
	start_avg_accel_z /=avg_index;

	start_avg_accel_x = get_acc_magn(start_avg_accel_x);			//get acc magnitude
	start_avg_accel_y = get_acc_magn(start_avg_accel_y);
	start_avg_accel_z = get_acc_magn(start_avg_accel_z);

	for(i = ACC_GYRO_FIFO_BUF_LEN-avg_index; i < ACC_GYRO_FIFO_BUF_LEN; i++)
	{
		end_avg_accel_x += acc_x_cur_buffer[i];
		end_avg_accel_y += acc_y_cur_buffer[i];
		end_avg_accel_z += acc_z_cur_buffer[i];
	}

	end_avg_accel_x /=avg_index;										//get average for each axis
	end_avg_accel_y /=avg_index;
	end_avg_accel_z /=avg_index;

	end_avg_accel_x = get_acc_magn(end_avg_accel_x);			//get acc magnitude
	end_avg_accel_y = get_acc_magn(end_avg_accel_y);
	end_avg_accel_z = get_acc_magn(end_avg_accel_z);

	num= (start_avg_accel_x*end_avg_accel_x) + (start_avg_accel_y*end_avg_accel_y) + (start_avg_accel_z*end_avg_accel_z);
	denom= (pow(start_avg_accel_x,2) + pow(start_avg_accel_y,2) + pow(start_avg_accel_z,2)) * (pow(end_avg_accel_x,2)+pow(end_avg_accel_y,2)+pow(end_avg_accel_z,2));
	angle=acos(num/sqrt(denom));

	angle_degree=angle *(180.0f/3.14159265f);						//get angle in degree

	return angle_degree;
}

static float acceleration_his_analyse_fifo(void)
{
    volatile uint16_t i;
    volatile float acc_magn_square = 0, max_acc_magn_square = 0;
    /*
    * Compute Accelerometer's Magnitude
    */
    for(i=0;i<ACC_GYRO_FIFO_BUF_LEN;i++)
    {
        //acc magnitude square to avoid sqrt() call to save time.

        acc_magn_square = pow(acc_x_hist_buffer[i],2)+pow(acc_y_hist_buffer[i],2)+pow(acc_z_hist_buffer[i],2);
        if(acc_magn_square > max_acc_magn_square) max_acc_magn_square = acc_magn_square;
    }
    return max_acc_magn_square;     //do once sqrt() to get acc magnitude
}


static float gyroscope_analyse_fifo(void)
{
	volatile uint16_t i;
	volatile float gyro_magn_square = 0, max_gyro_magn_square = 0;
	/*
	* Compute Gyroscope's Magnitude for all data after fall
	*/
	for(i=0;i<ACC_GYRO_FIFO_BUF_LEN*2;i++)
	{
		if(i < ACC_GYRO_FIFO_BUF_LEN)
		{
			//gyroscope magnitude square to avoid sqrt() call to save time.
			// gyro_magn_square = pow(get_gyro_magn(gyro_x_cur_buffer[i]),2)+pow(get_gyro_magn(gyro_y_cur_buffer[i]),2)+pow(get_gyro_magn(gyro_z_cur_buffer[i]),2);
			gyro_magn_square = pow(get_gyro_magn(gyro_y_hist_buffer[i]),2)+pow(get_gyro_magn(gyro_z_hist_buffer[i]),2);
		}
		else
		{
			gyro_magn_square = pow(get_gyro_magn(gyro_y_cur_buffer[i-ACC_GYRO_FIFO_BUF_LEN]),2)+pow(get_gyro_magn(gyro_z_cur_buffer[i-ACC_GYRO_FIFO_BUF_LEN]),2);
		}
		
		if(gyro_magn_square > max_gyro_magn_square) max_gyro_magn_square = gyro_magn_square;	//get the maximum gyroscope magnitude square
		
	}
	// return (sqrt(max_gyro_magn_square));		//do once sqrt() to get gyroscope magnitude
	return sqrt(max_gyro_magn_square);		//do once sqrt() to get gyroscope magnitude

}

static float fall_verification_fifo_skip(void)
{
	volatile uint16_t i;
	volatile float std_deviation = 0, variance=0,average = 0;

	memset(verify_acc_magn,0x00,VERIFY_DATA_BUF_LEN);
	//compute acc magnitude
	for(i=0;i<VERIFY_DATA_BUF_LEN;i++)
	{
		verify_acc_magn[i] = sqrt(pow(get_acc_magn(acc_x_vrif_buffer_1[i]),2)+ pow(get_acc_magn(acc_y_vrif_buffer_1[i]),2) + pow(get_acc_magn(acc_z_vrif_buffer_1[i]),2));
		average += verify_acc_magn[i];
	}

	average /= (float)VERIFY_DATA_BUF_LEN;

	//compute variance and standard deviation to a base 0.5g
	for(i=0;i<VERIFY_DATA_BUF_LEN;i++)
	{
		variance += pow((verify_acc_magn[i]-average),2);
	}
	std_deviation = sqrt(variance/(float)(VERIFY_DATA_BUF_LEN));

