duxinglang-1/nRF9160_test/AURI_TEST/src/imu/lsm6dso.c
	return std_deviation;
}

/**@brief Function for getting input degree according to angle or gyroscope magnitude.
 *
 * @return input degree in float.
 */
static float get_input_degree(float x, float a, float b, float c, float d)
{
	volatile float re_val=0;

	if(d == b)                  // Rshoulder
	{
		if(x >= b)                     re_val = 1;
		else if(x > a && x < b)        re_val = (x - a) / (b - a);
		else if(x <= a)                re_val = 0;
	}
	else if(d == c)             // Triangle
	{
		if(x <= a)                     re_val = 0;
		else if(x == b)                re_val = 1;
		else if(x < b)                 re_val = (x - a) / (b - a);
		else if(x >= c)                re_val = 0;
		else if(x > b)                 re_val = (c - x) / (c - b);
	}
	else if(d == a)             //Lshoulder
	{
		if(x <= c)                     re_val = 1;
		else if(x > c && x < d)        re_val = (d - x) / (d - c);
		else if(x >= d)                re_val = 0;
	}
	else re_val = 0;
	
	return re_val;
}

/**@brief Function for getting weight according to memship.
 *
 * @return weight in uint8_t.
 */
static uint8_t get_output_from_memship(uint8_t memship)
{
	if(memship == LOW_MS)    
		return WEIGHT_VALUE_10;
	else if(memship == MEDIUM_MS) 
		return WEIGHT_VALUE_30;
	else if(memship == HIGH_MS)   
		return WEIGHT_VALUE_50;
	else 
		return 0;
}

/**@brief Function for getting fuzzy output.
 *
 * @return fuzzy analysis output in float.
 */
static float fuzzy_analyse(float angle, float max_gyro_magn)
{
	volatile uint8_t i=0;
	volatile float fire_strength[9];
	volatile float sum_firestrenths = 0;
	volatile float output_value=0;

	volatile float low_angle_degree=0, medium_angle_degree=0, high_angle_degree=0;
	volatile float low_gyro_magnitude_degree=0, medium_gyro_magnitude_degree=0, high_gyro_magnitude_degree=0;
	volatile float current_angle = angle;  // should compute this value continously from sensor
	volatile float current_max_gyro_magn = max_gyro_magn;

	//===================================================1-Fuzzification
	low_angle_degree =    get_input_degree(current_angle, MEDIUM_ANGLE, 0, LOW_ANGLE, MEDIUM_ANGLE);
	medium_angle_degree = get_input_degree(current_angle, LOW_ANGLE, MEDIUM_ANGLE, HIGH_ANGLE, HIGH_ANGLE);
	high_angle_degree =   get_input_degree(current_angle, MEDIUM_ANGLE, HIGH_ANGLE, 0, HIGH_ANGLE);

	low_gyro_magnitude_degree =    get_input_degree(current_max_gyro_magn, MEDIUM_GYRO_MAGNITUDE, 0, LOW_GYRO_MAGNITUDE, MEDIUM_GYRO_MAGNITUDE);
	medium_gyro_magnitude_degree = get_input_degree(current_max_gyro_magn, LOW_GYRO_MAGNITUDE, MEDIUM_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE);
	high_gyro_magnitude_degree =   get_input_degree(current_max_gyro_magn, MEDIUM_GYRO_MAGNITUDE, HIGH_GYRO_MAGNITUDE, 0, HIGH_GYRO_MAGNITUDE);

	//===================================================2-Fire Strength
	fire_strength[0] = min(low_angle_degree   , low_gyro_magnitude_degree);
	fire_strength[1] = min(low_angle_degree   , medium_gyro_magnitude_degree);
	fire_strength[2] = min(low_angle_degree   , high_gyro_magnitude_degree);
	fire_strength[3] = min(medium_angle_degree, low_gyro_magnitude_degree);
	fire_strength[4] = min(medium_angle_degree, medium_gyro_magnitude_degree);
	fire_strength[5] = min(medium_angle_degree, high_gyro_magnitude_degree);
	fire_strength[6] = min(high_angle_degree  , low_gyro_magnitude_degree);
	fire_strength[7] = min(high_angle_degree  , medium_gyro_magnitude_degree);
	fire_strength[8] = min(high_angle_degree  , high_gyro_magnitude_degree);

	//======================================================3- linguistic and numric output
	for (i = 0; i < 9; i++)
	{
		output_value += fire_strength[i] * get_output_from_memship(suspicion_rules[i][2]);
		sum_firestrenths += fire_strength[i];
	}

	output_value /= sum_firestrenths;
	return output_value;
}

static float peak_analysis(void){

  volatile uint16_t i;
  peak_number = 0;

  for(i=0; i<(ACC_GYRO_FIFO_BUF_LEN * 4); i++){
    if(i < ACC_GYRO_FIFO_BUF_LEN){
      peak_analysis_array[i] = pow(get_acc_magn(acc_x_vrif_buffer[i]),2)
                             + pow(get_acc_magn(acc_y_vrif_buffer[i]),2)
                             + pow(get_acc_magn(acc_z_vrif_buffer[i]),2);
    }
    else if(i >= ACC_GYRO_FIFO_BUF_LEN && i < (ACC_GYRO_FIFO_BUF_LEN *2))
    {
      peak_analysis_array[i] = pow(get_acc_magn(acc_x_vrif_buffer_1[i-ACC_GYRO_FIFO_BUF_LEN]),2)
                             + pow(get_acc_magn(acc_y_vrif_buffer_1[i-ACC_GYRO_FIFO_BUF_LEN]),2)
                             + pow(get_acc_magn(acc_z_vrif_buffer_1[i-ACC_GYRO_FIFO_BUF_LEN]),2);
    }
    else if(i >= ACC_GYRO_FIFO_BUF_LEN*2 && i < (ACC_GYRO_FIFO_BUF_LEN *3))
    {
      peak_analysis_array[i] = pow(get_acc_magn(acc_x_vrif_buffer_2[i-ACC_GYRO_FIFO_BUF_LEN*2]),2)
                             + pow(get_acc_magn(acc_y_vrif_buffer_2[i-ACC_GYRO_FIFO_BUF_LEN*2]),2)
                             + pow(get_acc_magn(acc_z_vrif_buffer_2[i-ACC_GYRO_FIFO_BUF_LEN*2]),2);
    }
    else if(i >= ACC_GYRO_FIFO_BUF_LEN*3 && i < (ACC_GYRO_FIFO_BUF_LEN *4))
    {
      peak_analysis_array[i] = pow(get_acc_magn(acc_x_vrif_buffer_3[i-ACC_GYRO_FIFO_BUF_LEN*3]),2)
                             + pow(get_acc_magn(acc_y_vrif_buffer_3[i-ACC_GYRO_FIFO_BUF_LEN*3]),2)
                             + pow(get_acc_magn(acc_z_vrif_buffer_3[i-ACC_GYRO_FIFO_BUF_LEN*3]),2);
    }
  }

  for(i=3; i<(ACC_GYRO_FIFO_BUF_LEN * 4-3); i++){
      if(peak_analysis_array[i]>PEAK_THRES && peak_analysis_array[i]>peak_analysis_array[i+3] && peak_analysis_array[i] > peak_analysis_array[i-3]){
          peak_number++;
      }
  }
  
  return peak_number;
}

/*@brief Fall detection analyse
*
* @return If fall return 1, otherwise return 0
*/
void fall_detection(void)
{
	historic_buffer();
	LOGD("fall detecting 1");

	if(hist_buff_flag)
	{
        acc_magn_square = acceleration_his_analyse_fifo();
        cur_angle = 0;
        cur_max_gyro_magn = 0;
        peak_number = 0;
        cur_fuzzy_output = 0;
        std_devi = 0;
    
