duxinglang-1/nRF9160_test/AURI_TEST/src/imu/lsm6dso.c
        if(acc_magn_square > ACC_MAGN_TRIGGER_THRES_DEF)
        {
            curr_vrif_buffers();
        }
		hist_buff_flag = false;
		LOGD("fall detecting 2");
	}

	if(curr_vrif_buff_flag)
	{       
	    peak_number = peak_analysis();
	    if(peak_number < PEAKS_NO_THRES)
		{
            cur_angle = angle_analyse_fifo();
            cur_max_gyro_magn = gyroscope_analyse_fifo();
            cur_fuzzy_output = fuzzy_analyse(cur_angle, cur_max_gyro_magn);
            std_devi = fall_verification_fifo_skip();
		}

        /*uncomment to display info on screen: 
        *  
        LCD_Clear(0);
        sprintf(tmpbuf, "cur_angle is: %f", cur_angle);
        LCD_ShowString(20,80,tmpbuf); 
        sprintf(tmpbuf, "cur_max_gyro_magn: %f", cur_max_gyro_magn);
        LCD_ShowString(20,100,tmpbuf);
        sprintf(tmpbuf, "STD is: %f", std_devi);
        LCD_ShowString(20,120,tmpbuf);
        sprintf(tmpbuf, "Fuzzy Output is: %f", cur_fuzzy_output);
        LCD_ShowString(20,140,tmpbuf);
        */

        if(cur_fuzzy_output > FUZZY_OUT_THRES_DEF)
        {
            if(std_devi < STD_VARIANCE_THRES_DEF)
            {
                    fall_result = true;
                    //break;
            }
            else
            {
                    fall_result = false; //std not satisfied
            }
        }
        else
        {
			fall_result = false; //fuzzy output not satisfied
        }
		
		curr_vrif_buff_flag = false;
		sensor_init(); //resets the algorithm, will work continuosly on every tap
		LOGD("fall detecting 3");
	} 
}

void ReSetImuSteps(void)
{
	lsm6dso_steps_reset(&imu_dev_ctx);
}

void GetImuSteps(u16_t *steps)
{
	lsm6dso_number_of_steps_get(&imu_dev_ctx, steps);
}

void UpdateIMUData(void)
{
	GetImuSteps(&g_steps);

	g_distance = 0.7*g_steps;
	g_calorie = (0.8214*60*g_distance)/1000;

	LOGD("g_steps:%d,g_distance:%d,g_calorie:%d", g_steps, g_distance, g_calorie);

	StepCheckSendLocationData(g_steps);
}

void GetSportData(u16_t *steps, u16_t *calorie, u16_t *distance)
{
	if(steps != NULL)
		*steps = g_steps;
	if(calorie != NULL)
		*calorie = g_calorie;
	if(distance != NULL)
		*distance = g_distance;
}

/*@Set Sensor sensitivity
*/
void lsm6dso_sensitivity(void)
{
	//Set the debounce steps
	uint8_t deb_step = 5;
	lsm6dso_pedo_debounce_steps_set(&imu_dev_ctx, &deb_step);

	//Set the sensitivity of the sensor
	uint8_t delay_time[2] = {0x00U, 0x32U};
	//Lower Limit is 0 and Upper Limit is 50(32 in Hex), the delay time is 320ms
	lsm6dso_pedo_steps_period_set(&imu_dev_ctx, &delay_time);
}

static void mt_fall_detection(struct k_work *work)
{
	if(int1_event)	//steps or tilt
	{
		LOGD("int1 evt!");
		int1_event = false;

		if(!imu_check_ok)
			return;
		
	#ifdef CONFIG_PPG_SUPPORT
		if(PPGIsWorking())
			return;
	#endif

		if(!is_wearing())
			return;
		
		is_tilt();
		if(wrist_tilt)
		{
			LOGD("tilt trigger!");
			
			wrist_tilt = false;

			if(lcd_is_sleeping && global_settings.wake_screen_by_wrist)
			{
				sleep_out_by_wrist = true;
				lcd_sleep_out = true;
			}
		}
		else
		{
			LOGD("steps trigger!");
			
			UpdateIMUData();
			imu_redraw_steps_flag = true;	
		}
	}

	if(int2_event) //fall
	{
		LOGD("int2 evt!");
		
		int2_event = false;

		if(!imu_check_ok)
			return;

	#ifdef CONFIG_PPG_SUPPORT
		if(PPGIsWorking())
			return;
	#endif

		if(!is_wearing())
			return;

		fall_detection();
		if(fall_result)
		{
			LOGD("Fall trigger!");
			
			fall_result = false;
			lcd_sleep_out = true;
			
			FallAlarmStart();
		}
        else
        {
			LOGD("Not Fall.");
        }
	}
	
	if(reset_steps)
	{
		reset_steps = false;

		if(!imu_check_ok)
			return;
		
		ReSetImuSteps();
		imu_redraw_steps_flag = true;
	}

	if(imu_redraw_steps_flag)
	{
		imu_redraw_steps_flag = false;

		if(!imu_check_ok)
			return;
		
		IMURedrawSteps();
	}

	if(update_sleep_parameter)
	{
		update_sleep_parameter = false;

		if(!imu_check_ok)
			return;

	#ifdef CONFIG_PPG_SUPPORT
		if(PPGIsWorking())
			return;
	#endif

		UpdateSleepPara();
	}
}

void IMU_init(struct k_work_q *work_q)
{
	LOGD("IMU_init");
	
	imu_work_q = work_q;
	k_work_init(&imu_work, mt_fall_detection);
	
	if(init_i2c() != 0)
		return;
	
	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = i2c_imu;

	imu_check_ok = sensor_init();
	if(!imu_check_ok)
		return;
	
	lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter
	lsm6dso_sensitivity();
	StartSleepTimeMonitor();

	LOGD("IMU_init done!");
}

/*@brief Check if a wrist tilt happend
*
* @return If tilt detected, wrist_tilt=true, otherwise false
*/
void is_tilt(void)
{
	lsm6dso_all_sources_t status;

	lsm6dso_all_sources_get(&imu_dev_ctx, &status);
	if(status.fsm_status_a.is_fsm1)
	{ 
		//tilt detected
		wrist_tilt = true;
	}
}

/*@brief disable the wrist tilt detection
*
*/
void disable_tilt_detection(void)
{
	lsm6dso_all_sources_t status;
	
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_DISABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);
}

/*@brief enable the wrist tilt detection
*
*/
void enable_tilt_detection(void)
{
	lsm6dso_all_sources_t status;
	
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_ENABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);
}

void test_i2c(void)
{
	struct device *i2c_dev;
	struct device *dev0;

	dev0 = device_get_binding("GPIO_0");
	gpio_pin_configure(dev0, 0, GPIO_DIR_OUT);
	gpio_pin_write(dev0, 0, 1);

	LOGD("Starting i2c scanner...");

	i2c_dev = device_get_binding(IMU_DEV);
	if(!i2c_dev)
	{
		LOGD("I2C: Device driver not found.");
		return;
	}
	i2c_configure(i2c_dev, I2C_SPEED_SET(I2C_SPEED_STANDARD));
	uint8_t error = 0u;

	LOGD("Value of NRF_TWIM1_NS->PSEL.SCL: %ld",NRF_TWIM1_NS->PSEL.SCL);
	LOGD("Value of NRF_TWIM1_NS->PSEL.SDA: %ld",NRF_TWIM1_NS->PSEL.SDA);
	LOGD("Value of NRF_TWIM1_NS->FREQUENCY: %ld",NRF_TWIM1_NS->FREQUENCY);
	LOGD("26738688 -> 100k");
	LOGD("67108864 -> 250k");
	LOGD("104857600 -> 400k");

	for (u8_t i = 0; i < 0x7f; i++)
	{
		struct i2c_msg msgs[1];
		u8_t dst = 1;

		/* Send the address to read from */
		msgs[0].buf = &dst;
		msgs[0].len = 1U;
		msgs[0].flags = I2C_MSG_WRITE | I2C_MSG_STOP;

		error = i2c_transfer(i2c_dev, &msgs[0], 1, i);
		if(error == 0)
		{
			LOGD("0x%2x device address found on I2C Bus", i);
		}
		else
		{
			//LOGD("error %d", error);
		}
	}
}

void IMURedrawSteps(void)
{
	if(screen_id == SCREEN_ID_STEPS 
		|| screen_id == SCREEN_ID_DISTANCE 
		|| screen_id == SCREEN_ID_CALORIE
		)
	{
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void IMUMsgProcess(void)
{
#ifdef CONFIG_FOTA_DOWNLOAD
	if(fota_is_running())
		return;
#endif

	k_work_submit_to_queue(imu_work_q, &imu_work);
}
#endif/*CONFIG_IMU_SUPPORT*/
